<div class="home-terms">
	<H1><span class="icon-arrow2"></span> 使用條款</H1>
    <div>
        <span class="blod">1.使用條件</span><br />
        當您進入並使用本網站時，即視同您已同意遵守本使用條款的所有規定，以及本網站公佈的附加條款。若您不同意上述使用條件，請勿使用本網站。而您若不同意任何針對特定內容，或特定業務所訂定的附加條件，請勿使用含有這類內容或業務部分網頁，亦請勿使用這類內容，或進行這類交易。<br />
        <?php echo $this->config->item("webName");?> 得在不事先通知的情況下，隨時修正本使用條款，修正條款於本網站上張貼時隨即生效。故請您定期查詢公佈在本網站上的最新使用條款，確保您知悉本網站之最新使用規定。<br />
        <?php echo $this->config->item("webName");?> 亦保留得自行決定禁止網站的使用，或限制進出網站的權利。<br /><br />

        <span class="blod">2.義務與承諾</span><br />
        您承諾絕不為任何非法目的或以任何非法方式使用本網站，並承諾遵守中華民國相關法規及一切使用網際網路之國際慣例。您若係中華民國以外之使用者，並同意遵守所屬國家或地域之法令。同意遵守使用本網站的限制，包括但不限於：<br />
        a.不得隱瞞通過本網站傳送的資訊來源；<br />
        b.禁止向網站上載虛假或誤導性的資訊；禁止張貼或傳播任何不實廣告、宣傳資料或其他形式的誘騙性廣告。<br />
        c.禁止傳輸任何會侵犯他人權利的資料。<br />
        d.禁止向本網站輸入或上載任何含有病毒、欺騙程式、惡意程式、定時炸彈等病毒的資訊，或其他意圖損害、干擾、攔截或侵佔電腦系統、本網站或任何損害他人知識產權的電腦程式途徑；<br />
        e.禁止干擾或中斷本網站提供之各項服務或連接至此服務之伺服器或網路的行為。<br />
        f.禁止利用本網站提供之各項服務傳送或發表具威脅性、猥褻性、攻擊性、毀謗性的文字、圖片或任何形式的檔案。<br />
        g.禁止傳輸侵犯現行法律、國際相關法律的資料。<br /><br />

        <span class="blod">3.智慧財產權</span><br />
        本網站上的所有內容，包括著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計、軟體、影音，均由 <?php echo $this->config->item("webName");?> 依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。除 <?php echo $this->config->item("webName");?> 明示同意，任何人不得逕自使用、修改、重製、公開播送、改作、散布、發行、公開發表、進行還原工程、解編或反向組譯。若您欲引用或轉載前述網站內容，必須依法取得 <?php echo $this->config->item("webName");?> 事前書面同意。如有違反，您應依相關法律對 <?php echo $this->config->item("webName");?> 負損害賠償責任。<br />
        您若因個人及非商業之使用，得列印並使用本網站內容，惟該列印成品應保留所有版權、商標與專利來源資訊。任何人非經 <?php echo $this->config->item("webName");?> 之事前書面同意，不得將本網站內容以任何理由，用之於其他網址或電腦網際環境中，或轉登或轉發本網站內容，包括但不限於將本網站內容架構於另一網站中。<br /><br />

        <span class="blod">4.鏈結</span><br />
        本網站可能會有與第三方網站和資源的鏈結（合稱為「被鏈結網站」）。提供這些被鏈結的網站，僅為您的方便而已，並不表示 <?php echo $this->config->item("webName");?> 認可這些被鏈結網站的內容。<?php echo $this->config->item("webName");?> 對任何被鏈結網站的任何內容、軟體、服務或應用之正確性、準確性、性能或質量，不作任何聲明或保證。如您決定進入被鏈結的網站，您應自負責任。此外，使用被鏈結網站，應遵守任何適用的政策、條款及細則，包括但不限於被鏈結網站的保密政策。<br /><br />

        <span class="blod">5.第三人內容</span><br />
        當您使用本網站所提供的服務時，將任何資料上載、傳送或輸入本網站，視為您已授權本公司於本網站上重製、公開播送、修改、編緝或以其他方法利用這些資料，並可再授權第三人利用。您並應保證這些資料享有正當權利或已獲合法授權，不致侵害他人的智慧財產權。若您不具合法權利，請勿擅自將這些資料上載、傳送、或輸入本網站，否則您將因侵害智慧財產權而負刑事責任以及民事損害賠償責任。<br /><br />

        <span class="blod">6.拒絕保證聲明</span><br />
        <?php echo $this->config->item("webName");?> 雖努力確保本網站上資料的正確性，但不因此表示 <?php echo $this->config->item("webName");?> 應擔負任何責任。一切網站上資料的內容都按其「原貌」提供。<?php echo $this->config->item("webName");?> 在此明文排除任何明示或暗示的聲明或擔保，其中包括適銷性的擔保、特殊用途的擔保、未侵權的擔保，或對本網站的操作或內容資訊的準確性、完整性或準時性的擔保。<?php echo $this->config->item("webName");?> 並無就本網站的安全性加以聲明，亦不擔保本網站的安全性。您應認知任何傳送的資訊都可能遭攔截。<?php echo $this->config->item("webName");?> 並不擔保本網站、提供本網站的伺服器，或 <?php echo $this->config->item("webName");?> 傳送的電子通信絕無病毒，或任何有害的成份。<br /><br />

        <span class="blod">7.網路犯罪之處理</span><br />
        請勿於本網站販賣違禁品（如禁藥、毒品、槍械等）、或冒用他人名義（信用卡號）進行交易、散佈電腦病毒、侵入電腦系統或干擾其運作、誹謗他人名譽或侵害他人智慧財產權等行為。上述皆屬犯罪行為，一經發現<?php echo $this->config->item("webName");?>會將立即申報相關單位協助處理，並全力配合犯罪之偵查。若您發現有網友利用本網站提供的服務從事前述犯罪行為，請您儘速通知 <?php echo $this->config->item("webName");?> 處理，以維護本網站之網路秩序。<br /><br />

        <span class="blod">8.隱私權政策</span><br />
        對於您使用本網站的服務所留下的個人資料，<?php echo $this->config->item("webName");?> 予以絕對的尊重。透過或連結本網站而提供或收集的個人資料，將依 <?php echo $this->config->item("webName");?> 的「隱私保護方針」加以使用。<?php echo $this->config->item("webName");?> 不會出租或出售網站訪客的個人資訊給其他公司。<br /><br />

        <span class="blod">9.終止</span><br />
        您同意 <?php echo $this->config->item("webName");?> 可自行決定在任何時間、以或不以任何理由，終止或中止您使用本網站、系統、資訊、服務和內容。在中止或終止時，您必須立刻：（a）停止使用本網站；（b）銷毀任何已複製的內容。在此類「終止」或「中止」後，進入本網站、系統、資訊、服務和內容的行為，將構成法律上的侵權行為。並且，您同意 <?php echo $this->config->item("webName");?> 不就終止或中止您使用本網站、系統、資訊或服務, 對您或任何第三方承擔責任。<br /><br />

        <span class="blod">10.準據法與管轄法院</span><br />
        本使用條款之解釋與適用，以及與本使用條款有關的爭議，均應依照中華民國法律予以處理，並排除國際私法之適用。因本使用條款或使用本網站而引發任何求償或訴訟，您同意台灣桃園地方法院有專屬管轄權。<br /><br />

        <span class="blod">11.責任限制</span><br />
        無論在任何狀況下，<?php echo $this->config->item("webName");?> 或其任何關係企業及供應商均不會為任何因使用，或無法使用本網站或內容所導致，或引發的直接、間接、連帶、懲罰性、特殊，或偶發損害，其中包括失去業務、合約、收益、資料、資訊，或交易中斷等損害負責，即使 <?php echo $this->config->item("webName");?> 事先被告知該損害的可能性也不承擔責任。任何與本網站相關之訴訟，必須在訴訟原因發生後一年內起訴，並應以書面告知 <?php echo $this->config->item("webName");?>。<br /><br />

        <span class="blod">12.一般條款</span><br />
        您不得將本使用條款或任何本使用條款賦予您的權益或義務轉讓給他人。如本使用條款的任何規定在適當司法管轄權的法院被判定無效，該無效的規定不應影響該條款以外的其他規定之效力，其他規定仍應具有完全的執行力和效力。任何對使用條款的放棄，不得被視為對此條款或任何其他條款持續或永久之放棄。
    </div>
</div>